Tekla.Structures.Analysis.Remoting.CDelegateWrapper.#ctor(Tekla.Structures.Analysis.Remoting.ICDelegate,Tekla.Structures.Internal.WrapperFunctionalityBase)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportGetDotType(Tekla.Structures.AnalysisInternal.DotAnalysisObject@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportEnumerateAnalysisObjects(Tekla.Structures.AnalysisInternal.DotAnalysisObjectEnumerator@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportInsertAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportDeleteAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportAnalysisModelObjectOperation(Tekla.Structures.Analysis.DotAnalysisModelObjectOperation@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSetActiveAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportGetActiveAnalysisModel(Tekla.Structures.AnalysisInternal.DotAnalysisModel@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportInsertAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportDeleteAnalysisPart(Tekla.Structures.AnalysisInternal.DotAnalysisPart@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportInsertAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportDeleteAnalysisNode(Tekla.Structures.AnalysisInternal.DotAnalysisNode@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportInsertAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportDeleteAnalysisNodeLink(Tekla.Structures.AnalysisInternal.DotAnalysisNodeLink@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportInsertAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportDeleteAnalysisBar(Tekla.Structures.AnalysisInternal.DotAnalysisBar@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportInsertAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportDeleteAnalysisArea(Tekla.Structures.AnalysisInternal.DotAnalysisArea@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisVolume(Tekla.Structures.AnalysisInternal.DotAnalysisVolume@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisMember(Tekla.Structures.AnalysisInternal.DotAnalysisMember@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisMember(Tekla.Structures.AnalysisInternal.DotAnalysisMember@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisDecomposedNodeLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedNodeLoad@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisDecomposedBarLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedBarLoad@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisDecomposedAreaLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisDecomposedMemberLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedMemberLoad@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisDecomposedSelfweightLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedSelfweightLoad@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisDecomposedTemperatureLoad(Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedTemperatureLoad@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisEdge(Tekla.Structures.AnalysisInternal.DotAnalysisEdge@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisEdge(Tekla.Structures.AnalysisInternal.DotAnalysisEdge@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportInsertAnalysisPosition(Tekla.Structures.AnalysisInternal.DotAnalysisPosition@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisPosition(Tekla.Structures.AnalysisInternal.DotAnalysisPosition@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportMoveAnalysisPosition(Tekla.Structures.AnalysisInternal.DotAnalysisPositionMove@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisModelDesignProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisModelDesignProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelDesignProperties@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisModelJobProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisModelJobProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelJobProperties@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisModelModalAnalysisProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisModelModalAnalysisProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelModalAnalysisProperties@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisModelOutputProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisModelOutputProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelOutputProperties@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisModelSeismicProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisModelSeismicProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSeismicProperties@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisModelSpectrumProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisModelSpectrumProperties(Tekla.Structures.AnalysisInternal.DotAnalysisModelSpectrumProperties@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisDesignParameter(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisDesignParameter(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameter@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisDesignParameterMulti(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisDesignParameterMulti(Tekla.Structures.AnalysisInternal.DotAnalysisDesignParameterMulti@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisModelConnectivityRule(Tekla.Structures.AnalysisInternal.DotAnalysisModelConnectivityRule@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisFace(Tekla.Structures.AnalysisInternal.DotAnalysisFace@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisVolumeItem(Tekla.Structures.AnalysisInternal.DotAnalysisVolumeItem@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportInsertAnalysisCrossSection(Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportDeleteAnalysisCrossSection(Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisCrossSection(Tekla.Structures.AnalysisInternal.DotAnalysisCrossSection@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportInsertAnalysisSubSection(Tekla.Structures.AnalysisInternal.DotAnalysisSubSection@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t})
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisSubSection(Tekla.Structures.AnalysisInternal.DotAnalysisSubSection@,System.Collections.Generic.List{Tekla.Structures.Internal.dotPoint_t}@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisMaterial(Tekla.Structures.AnalysisInternal.DotAnalysisMaterial@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisRigidDiaphragm(Tekla.Structures.AnalysisInternal.DotAnalysisRigidDiaphragm@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisLoadGroup(Tekla.Structures.AnalysisInternal.DotAnalysisLoadGroup@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportInsertAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportSelectAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportModifyAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportDeleteAnalysisLoadCombination(Tekla.Structures.AnalysisInternal.DotAnalysisLoadCombination@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportInsertAnalysisResult(Tekla.Structures.AnalysisInternal.dotADResultCase_t@,Tekla.Structures.AnalysisInternal.dotADResultValue_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportDeleteAnalysisResults(Tekla.Structures.AnalysisInternal.dotADResultCase_t@,Tekla.Structures.AnalysisInternal.dotADResultValue_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportGetAnalysisResults(Tekla.Structures.AnalysisInternal.dotADResultValue_t,System.Int32,System.Collections.Generic.List{Tekla.Structures.AnalysisInternal.dotADResultValue_t}@)
DO NOT USE! For internal usage only!

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportGetAnalysisResultCase(Tekla.Structures.AnalysisInternal.dotADResultCase_t@)
DO NOT USE! For internal usage only!
Returns:

Tekla.Structures.Analysis.Remoting.CDelegateWrapper.ExportQueryAnalysisResult(Tekla.Structures.AnalysisInternal.dotADResultCase_t@,Tekla.Structures.AnalysisInternal.dotADResultValue_t@)
DO NOT USE! For internal usage only!
Returns: